

// מערך של ביטוחים
let insurance = [
    {num:"1", price:"0.2", sign:["רכב פרטי"], name:"רכב בטוח סוויץ",explanation:"ביטוח מקיף וחובה לרכב לפי ​קילומטראז'", img:"./img/1.jpg"},
    {num:"2", price:"3500", sign:["מונית", "רכב מסחרי"], name:"ביטוח מקיף",explanation:"ביטוח המכסה אובדן או נזק שנגרם לרכבך", img:"./img/2.jpg"},
    {num:"3", price:"6000", sign:["אופנוע", "משאית"], name:"ביטוח צד ג",explanation:"ביטוח המכסה את אחריותך במקרה של נזק שנגרם לצד", img:"./img/3.jpg"},
    {num:"4", price:"3000", sign:["רכב פרטי"], name:"ביטוח חובה לרכב",explanation:"פוליסת ביטוח המחויבת לרכישה על-פי חוק", img:"./img/4.jpg"},
    {num:"5", price:"2000", sign:["משאית"], name:"ביטוח מקיף למשאית",explanation:"מעניק כיסוי לנזק או לאובדן שנגרם למשאית", img:"./img/5.jpg"},
    {num:"6", price:"3000", sign:["מונית"], name:"ביטוח לכלי רכב מיוחדים",explanation:"מיעד לביטוח מונית טרקטורים, נגררים, מלגזות", img:"./img/6.jpg"},
    {num:"7", price:"4000", sign:["אופנוע"], name:"ביטוח צד ג לאופנוע",explanation:"לבעלי רכב דו-גלגלי או לנוהגים בכלי רכב דו-גלגלי", img:"./img/7.jpg"},
    {num:"8", price:"1500", sign:["רכב מסחרי"], name:"ביטוח סחר לרכב",explanation:"מאפשר לעוסקים בסחר כלי רכב לבטח את רכבם", img:"./img/8.jpg"}
]
window.localStorage.setItem("insurance", JSON.stringify(insurance))

// מערך של חומר לביטוחים
let insuranceMore = [
    {num:"1",explanation:["חיסכון בהוצאות הביטוח: משלמים לפי הקילומטרים שנוסעים - התשלום מורכב מרכיב קבוע וריכיב המשתנה בהתאם למרחק הנסיעה",
     "בעזרת רכיב חכם המותקן ברכב, ניתן לעקוב בכל עת אחר המרחק שעובר הרכב ואחר תשלום הפרמיה הצפוי בחודש הבא.",
     "הביטוח מיועד לנהגים מעל גיל 21 ועד גיל 85, עם עבר ביטוחי של 3 שנים ובעלי ותק נהיגה של מעל שנה.",
    "הביטוח מיועד לנהגים שבבעלותם רכב פרטי או מסחרי עד 3.5 טון, שערכו עד 350,000 ₪."]},
    {num:"2",explanation:["נזק מנזקי טבע, למשל: שיטפון, סערה, שלג וברד.",
    "נזק מאש, התפוצצות, התנגשות, התהפכות ומכל סוג שהוא.",
    "נזק שנגרם בעת גניבה או ניסיון גניבה.",
    "פיצוי כספי במקרה שרכבך נגנב."]},
    {num:"3",explanation:["סכום הפיצוי לביטוח צד ג' יהיה עד לסכום גובה האחריות בפוליסה עם אפשרות להגדלה עד 4 מיליון",
    "במקרה שרכב של צד ג' יצא מכלל שימוש הביטוח כולל הוצאות עבור גרירה של הרכב למקום התיקון הקרוב ביותר והוצאות נסיעה לצד ג'.",
    "החזר הוצאות בגין הפסדים מוכחים של צד ג' בשל השתתפות עצמית"]},
    {num:"4",explanation:["פוליסת ביטוח חובה לרכב כוללת כיסוי בגין נזקי גוף לפי חוק הפיצויים וכל חבות שתחול עליך בשל נזק גוף שייגרם לאדם כתוצאה מהשימוש ברכב. הכיסוי כולל, בין היתר, אובדן השתכרות ופיצוי בגין כאב וסבל (נזק שאינו נזק ממון).",
    "ביטוח המכסה את אחריותך לנזקי רכוש שייגרמו לצד ג'. כלומר, גרימת נזק לרכב או לרכוש של מישהו אחר כתוצאה משימוש ברכב.",
    "ביטוח מקיף לרכב, הכולל גם ביטוח אחריות כלפי צד שלישי בשל נזקי רכוש."]},
    {num:"5",explanation:["נזק או אובדן גמור שייגרם לרכבך כתוצאה מאש, התפוצצות, שיטפון, סערה, התנגשות, התהפכות, גניבה וכל נזק שייגרם תוך כדי גניבה ובעת ניסיון גניבה ומעשה זדון.",
    "ביטוח אחריותך בשל נזק שייגרם לרכוש של צד שלישי כתוצאה משימוש ברכבך בתקופת הביטוח, לרבות הוצאות משפט של המבוטח.",
    "ניתן לרכוש ביטוח מצומצם, הכולל אחריות כלפי צד שלישי בשל נזקי רכוש."]},
    {num:"6",explanation:["נזק או אובדן גמור שייגרם לרכבך כתוצאה מאש, התפוצצות, שיטפון, סערה, שלג, ברד, התנגשות, התהפכות, גניבה וכל נזק שייגרם תוך כדי גניבה ובעת ניסיון גניבה ומעשה זדון.",
    "ביטוח אחריותך בשל נזק שייגרם לרכוש של צד שלישי כתוצאה משימוש ברכבך בתקופת הביטוח, לרבות הוצאות משפט של המבוטח.",
    "ניתן לרכוש ביטוח מצומצם, הכולל אחריות כלפי צד שלישי בשל נזקי רכוש."]},
    {num:"7",explanation:["הפוליסה כוללת ביטוח אחריות כלפי צד שלישי בשל נזקי רכוש כתוצאה משימוש באופנוע. הפוליסה מעניקה כיסוי בגין אחריותך במקרים בהם נגרם נזק לרכב או לרכוש של מישהו אחר כתוצאה משימוש באופנוע.",]},
    {num:"8",explanation:["ביטוח סחר רכב מיועד לעוסקים בסחר כלי רכב ממונעים, למכוני מבחן של כלי רכב, בעלי מוסכים, יבואני רכב, מכונים להתקנת אבזור לרכב, מכוני שטיפה לרכב וכל עסק בו נוהגים בכלי רכב שאינם בבעלות העסק.",
    "לכיסוי חבות של המבוטח בשל נזק רכוש שייגרם לצד שלישי כתוצאה משימוש ברכב (למעט נזק שהמבוטח גרם בזדון).",]}
]

// בשלב זה עוד לא למדתי לתכנת בצד שרת זה הסיבה שהנתונים הם סטטים
